# Mid EXAM : Tools and Techniques Data Science

# Task 1: ( 5 Marks)  Warp up 

*   List item
*   List item

# Note : Rename the file with your name and id and also mention your name and id inside here

Name: Hunza Tahir
ID : F2022393009

In [ ]:
# Q1. Here, we take each element in the list a (temporarily assigning it the value i) 
a = [5, 10, 15, 20]

In [ ]:
# (i)	Find the square each element in the list. This creates a new list called b and does not modify a through data comprehension.

In [4]:
a = [5, 10, 15, 20]
b = [x**2 for x in a]
print (b)

[25, 100, 225, 400]

In [ ]:
# (ii)	Write a conditional statement of only squaring the elements if the element is not equal to 10.

In [5]:
a = [5, 10, 15, 20]
b = [x**2 if x != 10 else x for x in a]
print (b)

[25, 10, 225, 400]

In [ ]:
# Q2. (i) Write the command of random samples from a uniform distribution between 0 and 1?

In [6]:
import numpy as np

In [7]:
import random

samples = []
for _ in range(5):
    sample = random.random()
    samples.append(sample)
    print(sample)

0.9864595828627616
0.4205351630293519
0.2868064506454727
0.31340886540318336
0.9262626521495061

In [ ]:
#(ii)	Write the command to slice the column 1?

In [10]:
data_set = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
column1 = [row[1] for row in data_set]
column1 = []
for row in data_set:
    column1.append(row[1])
    print(column1)

[2]
[2, 5]
[2, 5, 8]

In [ ]:
#(iii)	Write the command of first and third elements in column 1?

In [12]:
column1_elements = [row[1] for row in data_set[::2]]
print(column1_elements)

[2, 8]

In [ ]:
#(iv)	 Write the command of returns an 8 x 4 array

In [14]:
array = [[0] * 4 for _ in range(8)]
print(array)

[[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]]

In [15]:
import pandas as pd

In [ ]:
#Q3. Create a Series that looks like this below:
Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [17]:
data = {'Flour': '4 cups', 'Milk': '1 cup', 'Eggs': '2 large', 'Spam': '1 can'}
series = pd.Series(data, name='Dinner')
print(data)

{'Flour': '4 cups', 'Milk': '1 cup', 'Eggs': '2 large', 'Spam': '1 can'}

In [18]:
# Q  4 Create the Data frame  as th output[27]

In [21]:
import pandas as pd

data = {'Apples': [35, 41], 'Bananas': [21, 34]}
index = ['2017Sales', '2018Sales']

df = pd.DataFrame(data, index=index)
print(df)

           Apples  Bananas
2017Sales      35       21
2018Sales      41       34

In [22]:
df

           Apples  Bananas
2017Sales      35       21
2018Sales      41       34

In [ ]:
#Q4. create Dataframe then find imputation for these missing NaN in the out[47]

In [24]:
import pandas as pd
import numpy as np

# Create the initial DataFrame with missing values
data = {
    'Age': [23.0, 39.0, 45.0, np.nan],
    'Gender': ['M', 'F', 'F', 'M'],
    'Income': [24200.0, np.nan, 45390.0, np.nan],
    'Religion': ['Muslim', 'Christian', np.nan, 'Muslim']
}

df = pd.DataFrame(data)

# Perform imputation to fill missing values
df_filled = df.fillna(method='ffill')

# Print the resulting DataFrame with imputed values
print(df_filled)

    Age Gender   Income   Religion
0  23.0      M  24200.0     Muslim
1  39.0      F  24200.0  Christian
2  45.0      F  45390.0  Christian
3  45.0      M  45390.0     Muslim

In [ ]:
df

    Age Gender   Income   Religion
0  23.0      M  24200.0     Muslim
1  39.0      F      NaN  chirstian
2  45.0      F  45390.0        NaN
3   NaN      M      NaN     Muslim

In [ ]:
#Q4(i)	Compute the appropriate missing value in income attribute?

In [25]:
income_mean = df['Income'].mean()
df['Income'].fillna(income_mean, inplace=True)

In [ ]:
#(ii)	Compute the appropriate missing values in religion attribute?

In [26]:
religion_mode = df['Religion'].mode()[0]
df['Religion'].fillna(religion_mode, inplace=True)

In [ ]:
#(iii)	Drop the columns where any of the elements is nan

In [27]:
df_dropped = df.dropna(axis=1)
print(df_dropped)

  Gender   Income   Religion
0      M  24200.0     Muslim
1      F  34795.0  Christian
2      F  45390.0     Muslim
3      M  34795.0     Muslim

In [ ]:
#(iv)	Keep only the rows with at least 2 non-na values

In [28]:
df_filtered = df.dropna(thresh=2, inplace=True)

print(df_filtered)

None